{
    "Game Theory Scenarios": "Escenarios de Teoría de Juegos",
    "View Simulation": "Ver Simulación",
    "Login": "Iniciar Sesión",
    "Dashboard": "Panel de Control",
    "Home": "Inicio",
    "Language": "Idioma",
    "English": "Inglés",
    "Spanish": "Español",
    "Player A": "Jugador A",
    "Player B": "Jugador B",
    "Strategy 1": "Estrategia 1",
    "Strategy 2": "Estrategia 2",
    "Payoff Matrix": "Matriz de Pagos",
    "Nash Equilibrium": "Equilibrio de Nash",
    "Cells highlighted in": "Las celdas resaltadas en",
    "Green": "Verde",
    "represent a Pure Nash Equilibrium": "representan un Equilibrio de Nash Puro",
    "Blue": "Azul",
    "Red": "Rojo",
    "Player A Payoff": "Pago Jugador A",
    "Player B Payoff": "Pago Jugador B",
    "Left": "Izquierda",
    "Right": "Derecha",
    "Top": "Arriba",
    "Bottom": "Abajo",
    "Payoff Matrix Interpretation": "Interpretación de la Matriz de Pagos",
    "Positive and Negative Values Selection": "Selección de Valores Positivos y Negativos",
    "Values in the matrix represent the utility or benefit each player receives. A scale of -10 to 10 has been selected to represent preference intensity:": "Los valores en la matriz representan la utilidad o beneficio que recibe cada jugador. Se ha seleccionado una escala de -10 a 10 para representar la intensidad de las preferencias:",
    "Range -10 to 10:": "Rango -10 a 10:",
    "Allows modeling a full spectrum of results, from catastrophic situations (-10) to ideal outcomes (10).": "Permite modelar un espectro completo de resultados, desde situaciones catastróficas (-10) hasta resultados ideales (10).",
    "Values 1 to 10 (Positive):": "Valores 1 a 10 (Positivos):",
    "Represent gains, benefits, or satisfaction. The higher the number, the greater the reward.": "Representan ganancias, beneficios o satisfacción. Cuanto mayor es el número, mayor es la recompensa.",
    "Value 0:": "Valor 0:",
    "Represents a neutral outcome, where there is neither significant gain nor loss (indifference point).": "Representa un resultado neutral, donde no hay ni ganancia ni pérdida significativa (punto de indiferencia).",
    "Values -10 to -1 (Negative):": "Valores -10 a -1 (Negativos):",
    "Represent costs, losses, punishments, or undesirable consequences. The lower the number (more negative), the worse the outcome.": "Representan costos, pérdidas, castigos o consecuencias indeseables. Cuanto menor es el número (más negativo), peor es el resultado.",
    "Nash Equilibrium (Green Cells)": "Equilibrio de Nash (Cuadros Verdes)",
    "Cells highlighted in green indicate a Nash Equilibrium. This means that, at that point, neither player has incentives to unilaterally change their strategy. If a player changes their decision while the other maintains theirs, their payoff would decrease or not improve. It is the \"stable\" state of the game where both strategies coincide optimally.": "Las celdas resaltadas en verde indican un Equilibrio de Nash. Esto significa que, en ese punto, ningún jugador tiene incentivos para cambiar su estrategia unilateralmente. Si un jugador cambia su decisión mientras el otro mantiene la suya, su pago disminuiría o no mejoraría. Es el estado \"estable\" del juego donde las estrategias de ambos coinciden óptimamente.",
    "Maximization, Optimization, and Rationality": "Maximización, Optimización y Racionalidad",
    "Rationality": "Racionalidad",
    "It is assumed that players are rational: they think logically, understand the rules, and always act to satisfy their own interests.": "Se asume que los jugadores son racionales: piensan lógicamente, entienden las reglas y siempre actúan para satisfacer sus propios intereses.",
    "Maximization": "Maximización",
    "The fundamental goal is to maximize their own utility. Each player seeks to obtain the highest possible value in the matrix for themselves.": "El objetivo fundamental es maximizar su propia utilidad. Cada jugador busca obtener el valor más alto posible en la matriz para sí mismo.",
    "Optimization": "Optimización",
    "It is the process of choosing the \"best response\" to the opponent's actions. It is not just seeking the highest number, but the best possible result given the circumstances.": "Es el proceso de elegir la \"mejor respuesta\" ante las acciones del oponente. No es solo buscar el número más alto, sino el mejor resultado posible dadas las circunstancias.",
    "Probability Calculation (Mixed Strategies)": "Cálculo de Probabilidades (Estrategias Mixtas)",
    "Calculation Origin": "Origen del Cálculo",
    "When no pure Nash equilibrium exists, players randomize their strategies to make the opponent indifferent. We calculate p and q by equating expected utilities.": "Cuando no existe un equilibrio de Nash puro, los jugadores aleatorizan sus estrategias para hacer que el oponente sea indiferente. Calculamos p y q igualando las utilidades esperadas.",
    "Result Validity:": "Validez del Resultado:",
    "Valid (0 to 1):": "Válido (0 a 1):",
    "If the result is between 0 and 1 (0% to 100%), a Mixed Strategy Nash Equilibrium exists.": "Si el resultado está entre 0 y 1 (0% a 100%), existe un Equilibrio de Nash en Estrategias Mixtas.",
    "Invalid (< 0 or > 1):": "Inválido (< 0 o > 1):",
    "If the result is negative or greater than 1, mathematically it is not a real probability. This indicates that no mixed equilibrium exists in this game (likely a pure dominant strategy exists).": "Si el resultado es negativo o mayor a 1, matemáticamente no es una probabilidad real. Esto indica que no existe un equilibrio mixto en este juego (probablemente hay una estrategia dominante pura).",
    "Algebraic Formulas and Substitution:": "Fórmulas Algebraicas y Sustitución:",
    "q (Probability B Left):": "q (Probabilidad B Izquierda):",
    "p (Probability A Top):": "p (Probabilidad A Arriba):",
    "Calculated Results": "Resultados Calculados",
    "Probability p (A)": "Probabilidad p (A)",
    "Probability q (B)": "Probabilidad q (B)",
    "Probability of each Cell": "Probabilidad de cada Celda",
    "Rows": "Filas",
    "Columns": "Columnas",
    "Mixed Strategies": "Estrategias Mixtas",
    "Dominant Strategies": "Estrategias Dominantes",
    "Strictly dominant because": "Estrictamente dominante porque",
    "and": "y",
    "No dominant strategies found.": "No se encontraron estrategias dominantes.",
    "Matrix Verification": "Verificación Matricial",
    "To find B's strategy (y, 1-y):": "Para encontrar la estrategia de B (y, 1-y):",
    "To find A's strategy (x, 1-x):": "Para encontrar la estrategia de A (x, 1-x):",
    "Range -10,000,000 to 10,000,000:": "Rango -10,000,000 a 10,000,000:",
    "Allows modeling a full spectrum of results, from large losses to large gains.": "Permite modelar un espectro completo de resultados, desde grandes pérdidas hasta grandes ganancias.",
    "Back to Simulations": "Volver a Simulaciones",
    "Strategies order switched": "Orden de estrategias cambiado",
    "Players switched": "Jugadores cambiados",
    "Changes saved successfully": "Cambios guardados exitosamente",
    "Error saving changes": "Error al guardar cambios",
    "An error occurred": "Ocurrió un error",
    "Are you sure you want to reset the simulation to default values?": "¿Estás seguro de que quieres restablecer la simulación a los valores predeterminados?",
    "Simulation reset to defaults": "Simulación restablecida a valores predeterminados",
    "Error resetting simulation": "Error al restablecer la simulación",
    "Save Changes": "Guardar Cambios",
    "Reset Default": "Restablecer",
    "Switch Strategies Order": "Cambiar Orden de Estrategias",
    "Switch Players": "Cambiar Jugadores",
    "Back to Payoff Matrix ->": "Regresar a la matriz de pagos ->",
    "Simulations - Game Theory": "Simulaciones - Teoría de Juegos",
    "Available Simulations": "Simulaciones Disponibles",
    "Simulations": "Simulaciones",
    "Admin Panel": "Panel de Administración",
    "Log Out": "Cerrar Sesión",
    "Register": "Registrarse",
    "Built by": "Desarrollado por",
    "Game Theory": "Teoría de Juegos",
    "What does this application do?": "¿Qué hace esta aplicación?",
    "Based on the mathematical concept developed by John Nash, this app allows users to study strategic situations where two or more players act independently.": "Basada en el concepto matemático desarrollado por John Nash, esta app permite a los usuarios estudiar situaciones estratégicas donde hay dos o más jugadores actuando de forma independiente.",
    "The goal is to demonstrate how stable states (equilibria) are reached where no player has incentives to unilaterally change, illustrating phenomena such as the prisoner's dilemma.": "El objetivo es demostrar cómo se alcanzan estados estables (equilibrios) donde ningún jugador tiene incentivos para cambiar unilateralmente, ilustrando fenómenos como el dilema del prisionero.",
    "Features and Usage": "Funcionalidades y Uso",
    "Simulate Models: Interact with payoff matrices and experiment in real time.": "Simular Modelos: Interactúa con matrices de pagos y experimenta en tiempo real.",
    "Calculate Equilibria: Automatically identify best responses and Nash equilibria.": "Calcular Equilibrios: Identifica automáticamente las mejores respuestas y equilibrios de Nash.",
    "Registration and Login: Create your account to save your custom simulations and scenarios.": "Registro y Login: Crea tu cuenta para guardar tus simulaciones y escenarios personalizados.",
    "Nash Equilibrium in Non-Cooperative Games": "Equilibrio de Nash en Juegos No Cooperativos",
    "In game theory, the Nash equilibrium, named after the mathematician John Nash, is the most common way to define the solution of a non-cooperative game involving two or more players. In a Nash equilibrium, each player is assumed to know the equilibrium strategies of the other players, and no player has anything to gain by changing only their own strategy.": "En la teoría de juegos, el equilibrio de Nash, llamado así por el matemático John Nash, es la forma más común de definir la solución de un juego no cooperativo que involucra a dos o más jugadores. En un equilibrio de Nash, se asume que cada jugador conoce las estrategias de equilibrio de los otros jugadores, y ningún jugador tiene nada que ganar cambiando solo su propia estrategia.",
    "For a basic 2x2 payoff matrix, we look for a pair of strategies where neither player can increase their payoff strictly by deviating, given the other player's choice.": "Para una matriz de pagos básica de 2x2, buscamos un par de estrategias donde ningún jugador puede aumentar su pago estrictamente desviándose, dada la elección del otro jugador.",
    "Go to Simulations": "Ir a Simulaciones",
    "What is it?": "¿Qué es?",
    "A stable state of a system involving the interaction of different participants, in which no participant can gain by a unilateral change of strategy if the strategies of the others remain unchanged.": "Un estado estable de un sistema que involucra la interacción de diferentes participantes, en el cual ningún participante puede ganar mediante un cambio unilateral de estrategia si las estrategias de los demás permanecen sin cambios.",
    "How to Calculate": "Cómo Calcularlo",
    "For player A, find the best response strategy for each of player B's strategies. Do the same for player B. If a cell in the matrix represents a best response for both players simultaneously, that cell is a Nash Equilibrium.": "Para el jugador A, encuentra la mejor estrategia de respuesta para cada una de las estrategias del jugador B. Haz lo mismo para el jugador B. Si una celda en la matriz representa una mejor respuesta para ambos jugadores simultáneamente, esa celda es un Equilibrio de Nash.",
    "Non-Cooperative": "No Cooperativo",
    "This model assumes players cannot form binding agreements. Each acts independently to maximize their own self-interest, often leading to outcomes that are not optimal for the group (like in the Prisoner's Dilemma).": "Este modelo asume que los jugadores no pueden formar acuerdos vinculantes. Cada uno actúa independientemente para maximizar su propio interés, a menudo llevando a resultados que no son óptimos para el grupo (como en el Dilema del Prisionero).",
    "Charted Points Table": "Tabla de Puntos Graficados",
    "A (p given q):": "A (p dado q):",
    "B (q given p):": "B (q dado p):",
    "Nash:": "Nash:"
}